[{"duration": 261, "thumbnail": "https://i.ytimg.com/vi/i05bI03nzv4/maxresdefault.jpg", "text": " Back in the car, back when the other breakdown, this time it's about Apple. Every time Apple releases a product, there's an explosion of memes. This is the iPhone 11 Pro. The new Mac Pro. Apple AirPods. Apple has been building their products to look different for years. Their computers didn't look like other computers, their phone didn't look like other phones, their watch didn't look like other watches. Oh, watch out. And it's exactly what we're seeing right now, the iPhone Pro and the three cameras. My favorite meme has to be the stove top. Fidget spinner was also great. The three-eyed Raven. Shout out Game of Thrones. I don't know what that is. I don't want to give it to Thrones. Okay. Even if those memes are making fun of the product, they're still essential to Apple's success. History has shown that being different, even if innovative, isn't always immediately welcome. People don't really like change. Let me cameras the universe. It looks weird. So the problem at hand for Apple is how do they get people to accept their innovative products as normal? Apple has always normalized their products through advertising. When the iPhone launched 12 years ago, the ad wasn't centered around the science behind making the iPhone or what went into it. It was centered around a word that everyone around the world knows. Hello. Hello. Hello. Fast forward to Tuesday's launch and even Apple's ad today is not centered around the metrics behind the phone. It's really talking about our day-to-day lives, showing coffee spilling on the phone or the phone in someone's purse getting rattled around or a cat knocking over the phone. Even right down to the name, everyone knows what an Apple is and uses it in their everyday life. It's like a floss, but that's like the point. Exactly. All of these memes increase the rate at which we see these Apple products. The more we see them, the more normal they become. Apple is sex. We want to signal how elegant, how smart, how creative we are. This isn't a phone. It's my attempt to signal to women that if you mate with me or your kids are more likely to survive than if you mate with someone carrying an Android phone. When I first saw someone with AirPods, I thought this was like the dumbest thing I'd ever seen. And now I have them and I love them. Take the three cameras on the iPhone Pro as an example. People said it looks like a razor, it looks like a stove top, and even if they're making fun of the camera, they're still feeding into Apple's core advertising principles and putting their innovative design up next to things that we understand and are comfortable with. Whoa. You know what I mean? Yeah. How about that? So before the phone hits the shelves, before we even watch the keynote or the ads or even the reviews from the YouTubers, we'd already seen upwards of 50 to 60 memes informing us about the phone. Once I saw the first meme, I was like, oh, okay, I get it. I also knew that it was probably really expensive and that at first I was going to think it was stupid, but then I'm going to buy it. SpongeBob meme. Ultimately, the memes normalize the innovation, make the products desirable, and lead to more sales crap. This is what a line looks like on an iPhone launch day. Almost 90% of all smartphone profits are crude to Apple. Most exposure, increased sales. And Apple, more so than other tech brands, is right for taking advantage of this meme culture. Beams are a tool for conversation. So you need to be remarkable in order for people to actually make a remark about you. Apple's products are just that. The most valuable company in the world with some products that are really quite amazing. There aren't going to be many stories like that. They didn't need to leave the notch in the iPhone 10, but they did, and it became remarkable. I want to give you guys a cure today, a solution to a problem. The phones stood out amongst the rest, and the memes helped people make it normal by association. Relatability drives the verality of a meme. The more relatable, the more shareable. Apple is very relatable at this point. An Apple meme can speak to basically anyone in the world. So you actually want to create the meme, and you want to go viral. And that just feeds into this whole world of normalizing Apple's innovation, leading to more acceptance for Apple and more sales. People can relate to other people far better than a company can. So essentially, we are all doing Apple's job by using memes to normalize their product and advertise it to the masses. Alright, so that's our breakdown this week. Make sure to subscribe to the channel and comment below what was your favorite meme from the Apple launch, and maybe just your favorite meme in general. This week's shoutout is to Anisha. Thanks for watching Anisha. And if you want to be shouted out in next week's video, just retweet this post on Twitter. Why are we in a car? Uh, that's it, right? That's it? That's the end of the video. Alright, peace. Fresh air. Oh my god.", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LmkwNWJJMDNuenY0", "videoId": "i05bI03nzv4", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "videoUrl": "https://www.youtube.com/watch?v=i05bI03nzv4", "description": "Colin and Samir break down Apple advertising to show how they work with meme culture to spread awareness about new products like the Airpods 2 or iPhone 11 PRO and apple watch on social media with memes. \n\nRT this tweet to get a shout out next week:\nhttps://twitter.com/ColinandSamir/status/1173370715078135808\n\n#apple #iphone11 #iphonepro\n\nListen to Our Podcast: \n\niTunes: https://apple.co/2K1pYhu\n\nSpotify: https://spoti.fi/2OnTmBC\n\n----------------------------\n\nThe Gear we use to make our videos: https://kit.com/colinandsamir\n\nThe music we use to make our videos: http://share.mscbd.fm/colinandsamir\n-----------------------------\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nFollow us on Instagram:  http://instagram.com/colinandsamir\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nThe Shirts we wear: https://www.theragaman.com/\n\nSEND US A STORY to colinandsamir@gmail.com", "publishedAt": "2019-09-15", "transcript_status": true, "title": "Apple's Complex Relationship with Memes"}, {"id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LlRueVVDQS00QnVR", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "duration": 280, "videoId": "TnyUCA-4BuQ", "videoUrl": "https://www.youtube.com/watch?v=TnyUCA-4BuQ", "title": "Finding the Solution to Traffic", "text": " So here's how traffic works. People don't drive the same speed and they don't accelerate at the same rate. So if one person slows down for any reason, it moves like a shockwave and the buildup affects people for hours down the line. And traffic is a problem for people all over the world. It's especially a problem for us because we live in Los Angeles. 10 a.m. on the 5 freeway, we're going 0 miles an hour. This is 2 p.m. on the 10 freeway. I'm literally going like 4 miles and I'm actually going 4 miles per hour. 7 o'clock right now on the 405, going about 3 miles an hour. 8.20 p.m. on the 10 freeway and we're still in traffic. 35 minutes to go about 4 miles. Alright, so if you've been watching our channel, you know that every week we break down a trending topic. Typically, we talk about YouTube and entertainment. Well, this week we got a package in the mail and it was this new drone from Autel Robotics. And because they're sponsoring this video, we wanted to pick a topic where we could actually use the product to break down the topic. Hence traffic. So every aerial shot you'll see in this video is shot with this drone. Alright, more about this at the end of the video. So even though traffic affects us on a daily basis, we were in sure it was going to be a super interesting topic. Once we started looking into it, it is fascinating. The stuff we found out is super interesting. LA has actually one of the most advanced systems to combat traffic of anywhere in the world. To explain this system, we're going to need to use this clip from the Italian job. In this clip, Seth Green hacks into a computer and takes control of LA's traffic lights in order to clear the roads. And that control room he hacks into is real. And it actually has the ability to change the traffic lights in LA at any given moment. So if a bus is running late, they can actually adjust the green lights to make sure that it catches up on schedule. The craziest thing is that if a celebrity is late for an award show, the traffic officer can actually call into the control center and have them flip all the lights, green, and all the other ones red so they can make it there on time. I'll see you later. Taste with a lamp. Take care, man. You know what people say? That's when all the love made it. That's when we'll know. That's when we'll know. Yeah, that'll happen. That won't happen. So there's another thing that a couple of different cities are trying and they're thinking about trying it in Los Angeles. It's called congestion pricing, which we basically charge you a toll or a fee if you go into a highly traffic area during a certain time of the day. This is something that's already happening in London and now as of this year, New York City and the last solution that is coming not only to Los Angeles, but cities all over are self driving cars. This car drives itself. So this is kind of going to be fun. The gas and brakes and they're free. Look at that. Look at that. So if everyone was going the exact same speed, there probably wouldn't be that much traffic. And the bottom line is even if they're still traffic in the future by 2028, we're going to be able to do a lot more with that time. Rock, paper, scissors, shoot. Maybe we've become friends with David Delberg. We're getting out of the Tesla. Shut up. Yeah. No. That would be cool. I feel like a self driving car would be really helpful to film a video like this. So we could just talk to the camera. We could not make this video without talking about Elon Musk building a tunnel in Los Angeles. This is the boring tunnel. Shout out, Elon, if you're watching. Musk wants to help build a network of underground tunnels where driverless cars would shuttle passengers to and from multiple stations. So you think that tunnels are the way to do it? Oh, it'll work for sure. That'll work. Yes. So thanks so much to Autel Robotics for sending us this drone. It's honestly incredible. And we're actually going to give one away to one of you who comments on this video. You need to be US based. You need to be a subscriber to this channel. And again, you got to leave a comment on this video. Next week, we'll choose one of you from the comments and message you so that you can get your Autel Robotics e-boat drone. A couple of things for those of you who are interested and like drones. It can film 4K at 60 frames per second, which basically means in slow motion, it's still really high resolution and you can punch in like this. It also has a live feed straight to the remote so you can operate it without a phone. It's honestly just an incredible camera and I'm sure you can tell from all the aerial shots we used in this video. So check out the link in our description for Autel Robotics and the e-boat drone if you want to learn more about it. Or pick up one for yourself and maybe film the traffic in your city. Most of our breakdowns recently have been about YouTubers, but let us know what you think about this breakdown on traffic. We've also been getting a lot of new subscribers and people tweeting at us lately, which is amazing. Thank you to everyone who subscribed. We want to give a shout out to somebody who tweeted out us recently on Twitter. Shout out to you, Quentin. Thanks again to everyone who follows us. If you don't subscribe, subscribe. Alright, we'll be back here next week breaking down another topic right here on our channel. And if you get stuck in traffic this week, check out our podcast.", "publishedAt": "2019-09-01", "thumbnail": "https://i.ytimg.com/vi/TnyUCA-4BuQ/maxresdefault.jpg", "description": "Traffic is a problem that people around the world face. Cities like New York, London, New Delhi and Los Angeles are trying different methods like congestion pricing and self driving cars to solve the issue. Thanks to https://auteldrones.com for sponsoring this video!\n\nSubscribe to Autel on YouTube: \nhttps://www.youtube.com/channel/UC1QYiRZkTUkmyW7atm776nA\n\nSources: \n1. https://la.curbed.com/2012/1/26/10402270/inside-las-super-cool-traffic-light-control-system\n2. https://www.bloomberg.com/news/articles/2019-02-28/london-s-congestion-charge-has-cut-traffic-by-30-percent\n3. https://www.youtube.com/watch?v=iHzzSao6ypE\n\n\nListen to Our Podcast: \n\niTunes: https://apple.co/2K1pYhu\n\nSpotify: https://spoti.fi/2OnTmBC\n\n----------------------------\n\nThe Gear we use to make our videos: https://kit.com/colinandsamir\n\nThe music we use to make our videos: http://share.mscbd.fm/colinandsamir\n-----------------------------\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nFollow us on Instagram:  http://instagram.com/colinandsamir\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\n\nSEND US A STORY to colinandsamir@gmail.com", "transcript_status": true}, {"description": "With social media addiction on the rise and creators leaving Instagram in large numbers due to mental health, Colin and Samir offer ways to use the platform responsibly. \n\nListen to Our Podcast: \n\niTunes: https://apple.co/2K1pYhu\n\nSpotify: https://spoti.fi/2OnTmBC\n\n----------------------------\n\nThe Gear we use to make our videos: https://kit.com/colinandsamir\n\nThe Skateboards we make: https://boardies.us/products/the-classic\n\n-----------------------------\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nFollow us on Instagram:  http://instagram.com/colinandsamir\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\n\nSEND US A STORY to colinandsamir@gmail.com Sign up for a 30-day free trial to Musicbed: http://share.mscbd.fm/colinandsamir\n\nCheck out our playlist: http://share.mscbd.fm/colinandsamirplaylist", "duration": 265, "videoUrl": "https://www.youtube.com/watch?v=sNGOgBcCcA4", "thumbnail": "https://i.ytimg.com/vi/sNGOgBcCcA4/maxresdefault.jpg", "videoId": "sNGOgBcCcA4", "text": " So we've been thinking about it and the more we use it the more it kind of just makes us feel like Instagram is ranked the worst social network for young people's mental health. spending an hour plus on Instagram a day can be more destructive than spending an hour a day on Twitter. Basically today we're just gonna be talking about by Instagram sucks. He judged yourself he can pay us off to all these Instagram is. But it's something that everyone uses and everyone's always on it so you don't want to not be on. FOMO. Fear of missing out. But the interesting thing is that we're all creators so without social media without Instagram we don't really have jobs. Do I need to be liked? Absolutely not. I like to be liked. I enjoy being liked. I have to be liked. So what we've done is we've come up with a strategy to maximize all of the good parts of Instagram but minimize all of the harmful effects. It's calling in Samir's Guide to using Instagram responsibly. The first thing in our guide to using Instagram responsibly is actually to delete the app but not for good. Not forever. Just delete it so that it's a real pain in the ass every time you do want to use it. So if you download the app and then use it for something specific whether that's to post or to check something and then right when you're done delete it. That makes it incredibly intentional anytime you have to use the app and it's for a specific purpose and there's no opportunity to have mindless scrolling. Well you get a lot of different types of content on your Instagram man. Yeah it's a real mess. Kim Kardashian. You need to follow Kim Kardashian? I kind of do. I really want to be in the know. I don't follow any Kardashians. I follow far too many Kardashians. Do you need to follow? Listen I'm blipin' that out because no one needs to know that I follow that. That's like my Instagram guilty pleasure man. That's good. What's your guilty pleasure on Instagram? Like what's like the one account you're like, oh man this is a pretty deep cut like what I follow. Number two be selective about who you follow. So I try and just follow friends of mine and people that inspire me to create and make different types of work. A lot of times I'll go through, look through my feed and unfollow people that I honestly have no connection to or mute people that I don't really want to know that I've unfollowed. God I want to know your list of muted people. It's basically like taking a minimalist approach to Instagram and just following the necessities of anything that brings you inspiration or connection, anything that you really feel like is a necessity and then kind of trimming out the rest. Item and sucked in. Now you're just scrolling. Alright, delete the app. Not, we're not done with it yet. You want to look at my DMs? Let me see your DMs man. What do you mean don't read that? Like you can see who they're from but just don't like it. Whoa! Okay so number three, try and use the app with the intention of creating real life opportunities or connections. A lot of photographers use it this way to meet either people to shoot with or just friends in the community that can show them around and take them to cool spots to take photographs. And someone we met this way is Sam Elkins. He's an awesome photographer and he's based here in Los Angeles. That's a cool part about social media to me is just I get the chance to meet so many talented people and collaborate with, which you know, collaboration is a huge part of my job. Whether that be for videos or photos, social media in general is just by far the largest the best way to meet people now it is. And you get to meet people that you literally never would have crossed paths with, you know, that would probably even make you guys a good one for that. So those are our thoughts on Instagram and how to use it more intentionally and kind of responsibly. And while we're on the topic of this whole deleting Instagram thing, if you have not deleted it yet and you still have it, give us a follow at Colin and Samir. We just hit 10,000 followers, which was super exciting. So thank you to everyone out there who does follow. But again, if you don't like what we're putting out, just mute us. Just mute us. That way our feelings don't get hurt. Yeah. Okay. Alright. During the course of making this video, Colin has been scrolling Instagram almost the entire time. It's bad. Honestly. That's delete. Cool. Yeah, I'll delete it.", "publishedAt": "2019-04-28", "title": "How to Fix INSTAGRAM", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LnNOR09nQmNDY0E0", "transcript_status": true}, {"transcript_status": true, "title": "NOT a Samsung Galaxy Fold Review", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "thumbnail": "https://i.ytimg.com/vi/re_osGoZf9w/maxresdefault.jpg", "duration": 280, "text": " So today's Tuesday and we're doing something that's like that really something we typically get invited to This is like a tech release. You mean something we've never been invited to? It never reminds us of something like this. Check check check check you ready? Yep so we don't use Samsung phones we've actually never had an android device Until now We got the fold They gave us two of them Did you know it folds? If there's anyone out there that doesn't know the new phone at this point It's everywhere But we've always wanted to go to a Samsung event Ready man? Yep Samsung has become this aspirational brand for us We're really excited that we got invited to this Samsung event here in West Hollywood About the new galaxy fold phone How does that happen even when we have never owned a Samsung phone Nor an android device I'm not being paid by Samsung to make this video. I just like work for them in the past I think the first thing we saw was the human drone Yeah so Samsung started facilitating different videos for Casey the first one I remember is the human drone Here we go buddy We're done And that was something that happened during Christmas time That was viewed as you know Casey having this wild idea and this brand Samsung coming in and just supporting him The next thing we saw was the do what you can't campaign which had a one-minute commercial during the Oscars Maybe you've seen the commercial that I was starring Allow me to introduce the rest of us That's the biggest night in filmmaking and they're putting creators at the forefront here Whoa Samsung is serious about YouTube creators Today really put a stake in the ground as being like the Nike of YouTube creators trying to Champion and motivate and encourage people to create with their devices when we're told that we can't we all have the same answer Watch me I mean if you think about it do what you can't is basically the same thing as just do it sort of basically They're very similar after that we saw Samsung getting involved with even more creators And even in their recent marketing for the fold they've put creators front and center in their advertising now Something interesting about Samsung that we saw at the event is that even from a functionality standpoint They're catering to creators And you can change all those settings for all of you guys wow Wow that's cool Change the white balance You can even grab manual focus Right All of it's up to you guys They have a super slow-mo that's 960 frames per second Building you right now Video Yeah In the super wide And super wide The bottom line here is that Samsung is getting involved in our community in a really authentic way And going as deep as they possibly can into supporting creators with creation We use Apple products to edit our videos But Apple took out the SD card slot on our computer That's such a pain It's still annoying I hate having dongles Dongles are just the worst We don't do tech reviews so we're not going to sit here and tell you that The Samsung phone is going to be better than an Apple phone or anything like that But in terms of the way they're at least getting involved in our community And the steps they're taking to change their products It does seem like Samsung is at least more considerate More invested in this creator community Even right down to the fact that on their YouTube channel They allow comments Whereas on Apple They don't That's saying something You got to have the guts to leave the comments section enabled It seems like if we were to have a big idea They would be a brand who could actually come and get behind it Help us along our journey as becoming creators and filmmakers And that's why it's always felt so aspirational for us to get involved with them That has to be like the best unboxing experience I've ever seen We were treated super well Yet breakfast Lunch Multiple different options for wraps Lot of snacks There was other creators that showed up like Chris Chan who were huge fans of Jake Roper was there So it really felt like they were creating events and these spaces for creators to just be themselves You want to know about the technology behind this phone Go check out maybe Casey's video Sarah Dichy actually did a three minute vertical video It's everything you need to know We'll link that in the description Let us know what you think about Samsung as a brand Do you share the same feelings as us Let us know what you think about this galaxy Fold that you're seeing everywhere right now And follow us on Instagram Check out our podcast Subscribe to this YouTube channel See you later", "publishedAt": "2019-04-21", "videoUrl": "https://www.youtube.com/watch?v=re_osGoZf9w", "description": "Colin and Samir get the new Galaxy Fold Phone and talk about how Samsung has become an aspirational brand via integrating deeply with the creator community and specifically Casey Neistat. \n\nWatch Sarah's review of the Galaxy Fold\nhttps://www.youtube.com/watch?v=EgcZAjODx04\n\nListen to Our Podcast: \n\niTunes: https://apple.co/2K1pYhu\n\nSpotify: https://spoti.fi/2OnTmBC\n\n----------------------------\n\nThe Gear we use to make our videos: https://kit.com/colinandsamir\n\nThe Skateboards we make: https://boardies.us/products/the-classic\n\n-----------------------------\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nFollow us on Instagram:  http://instagram.com/colinandsamir\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\n\nSEND US A STORY to colinandsamir@gmail.com Sign up for a 30-day free trial to Musicbed: http://share.mscbd.fm/colinandsamir\n\nCheck out our playlist: http://share.mscbd.fm/colinandsamirplaylist", "videoId": "re_osGoZf9w", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LnJlX29zR29aZjl3"}, {"text": " Have you ever scrolled Instagram and thought wait is this person actually a robot? Probably not we assume that the people we follow are actually real, but what if they weren't which one of these people is real I mean, I'll look like real people this girl right here. She's not real This is little Michaela. She's a 19 year old Brazilian American model and singer from Los Angeles But she's not real. She's real to me. What yeah? She's computer generated and created by a mysterious LA base startup called broad their team of writers and storytellers dictate her every move She has 1.2 million followers and she collaborates with major artists brands and is showing up everywhere I mean you can tell like if you you zoom in Yeah, but the thing is people even if they know they don't care right? Okay, here's her story She's a girl who just found out that she's a robot and she's coming to terms with being lied to by her creators It's a fun story to follow and people seem to be really empathizing with it like lots of people today Lil Michaela was announced to be on time magazine's list of the top 25 most influential people on the internet She actually posted on Instagram about it and here's what she said today was the biggest day of my career I can't believe I was named on the same list as my personal heroes like Rihanna Rihanna's on this list Okay, wait here's the thing I happen to get the text telling me I'm on the list and I damn near lost my mind in the street What so it feels realistic? It's like something the real person would say they got a text she didn't get a text She doesn't have a phone they like her dialogue they'd better die She's on the people she did a brand deal with product did a product line with them for a long And she was on a billboard we just came here because this entire wall was taken up by her And there must be incredible which is just crazy to think about it like this is like our influencers gonna get replaced Here's the thing low Michaela making the top 25 most influential people on the internet She took someone's spot on that list that could have been another person and would have changed their entire career It's already happening she replaced someone so made wait they've made three robots Yeah, yeah, broad is creating an entire cast of characters that you can follow they all have different storylines Lakko is her brother from you. That is her arch rival who now she's okay with basically just a hit drama TV show Taking place on Instagram on a bunch of different accounts that are all interacting with each other and it could last forever I think this is no different than an animated character like you're right I don't think it's that different from a Disney character that you follow and that you love you just like the story and what this person stands for I think the reality is storytelling always wins if you have a good story. It's gonna connect with people So I think that is exactly why people feel really connected to her because it's written as if she were real person at the end of the day Loma Kayla is not a robot. She's just a good story written by a team of talented writers and graphic artists But it begs the question how far are we from a robot writing its own story generating its own images and truly growing a fan base and an audience without the help of humans We think AI can help with this problem I have something out here Hi, I'm trying to go to the woman care cut for a client. I'm looking for something on May 3rd It worked and we wore a weapon So thanks for watching our video. This is a topic that has really interested us and we want to hear your thoughts What if we're actually just robots Whoa, okay, you know what I mean? All right, just saying whoa So subscribe to our channel and comment below let us know what you think about artificial intelligence and robots replacing influencers She makes her followers feel like they know her that's insane I mean, but that's what makes her so valuable to brands because Not every influencer can even do that like it does require a lot of skill to tell a story on Instagram about yourself and make it personal and make it interesting to everybody", "thumbnail": "https://i.ytimg.com/vi/K-hnbTqo6ko/maxresdefault.jpg", "description": "FOLLOW UP VID: https://youtu.be/i4rwlQ7IA1U\n\nColin and Samir break down virtual influencer Lil Miquela and what it means for the influencer economy. \n\nListen to our Podcast about Lil Miquela with Kerry Furrh\niTunes: https://apple.co/2uDdvLj\nSpotify: https://spoti.fi/2usxhtU\n\nThis piece was edited and co-produced with Kerry Furrh. You can check out more of her work at her website: http://www.kerryfurrh.net/\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nFollow us on Instagram:  http://instagram.com/colinandsamir\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "videoId": "K-hnbTqo6ko", "title": "Lil Miquela Robots are taking over Social Media", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "transcript_status": true, "publishedAt": "2018-07-16", "videoUrl": "https://www.youtube.com/watch?v=K-hnbTqo6ko", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LkstaG5iVHFvNmtv", "duration": 253}, {"channelId": "UCamLstJyCa-t5gfZegxsFMw", "videoUrl": "https://www.youtube.com/watch?v=pwkOf7A6hkw", "thumbnail": "https://i.ytimg.com/vi/pwkOf7A6hkw/maxresdefault.jpg", "text": " So what do you do? Throughout your life you will get asked this question a lot. And whatever your answer is, it doesn't define you. It couldn't possibly paint the full picture. We don't have a great answer. And we often ask other people to define it for us. They'll call on some mere. What do they make content about? It's hard to say what it is at first. That's a problem. But what we want to be and what we tell people we are is documentary filmmakers. So this week we decided to document a little bit of each day to see if what we say we do and what we want to do is what we actually do. Starting with Monday. We released a podcast. One of our biggest goals is to put a film in a film festival. Filmed our show for the lacrosse network. A lot happened in lacrosse this week. Filmed our video for Weekend Film Fest. It was one of our biggest weeks of Weekend Film Fest to date and edited. Tuesday started off slow and we pondered the bigger questions we have about life. I don't know man. Looks smooth. Looks smooth. Still don't get how those work. It's so hot. Then we got lunch, skated to the post office, and planned for our July 4th trip to Denver where we're making videos for new balance. Do you want any new new balance gear? I think I see it. Yeah. Wednesday we got coffee and talked about what a colony in some of your video looks like. What defines our style? We didn't have a camera so we shot all of this with our phone. We spent the rest of the day editing but there's no footage for that. Just don't throw me the bad pass. Not going to be a problem. Thursday we started the day doing what we've done for years. Coming up with ideas while having a catch. Only way this all comes to life is more days like today. And then we spent the rest of the day editing. That's it. More days like today. On Friday the video that we were editing came out. You have to move based on opportunity. We recorded a podcast in Venice. But it's more like a vlog podcast where you just live life and we happen to be recording. It's called clogging. Brett, do you have the house right now? Then we went to the Yes Theory house for a meeting about a secret project. Okay, yeah so I haven't pretty much chronological order. After nearly avoiding a scooter accident. Almost ran into me there. Stop sign. I don't know what to tell you. Dangerous bird runner man. We got to follow the rules of the road. We went back downtown to meet up with Matt Diavella to help him shoot some photos. Con and Samara agreed to help me out. I'm redoing the website because right now it's looking, it's not very inspiring. We also filmed our video for We Can Film Fest. We are filming this video on a phone and this week's challenge is to make a video. Using your phone. And we got the idea for that one on Wednesday when all we had was a cell phone. Saturday we were back down in the studio making a video about artificial intelligence with Kerry. Kerry, what do you help us with? All your research pieces. The ones that are desk shows. It's fun. I like working with you guys. And Sunday, the one day that we pretty much always spend apart. Jake and I are here in this line. So that was our week. Let's run that back real quick. We say we're documentary filmmakers, but almost none of that was documentary filmmaking. We get that this is kind of a documentary, but it's not the type that we have in our minds. If you have a goal, we recommend tracking it every day because what you do is more about how you spend your time. And if your answer doesn't match up with reality, you need to take a step back and figure out how to actually do that. How to spend more time going for your goal. The thing about documenting the week. I wore the same shirt twice. I just realized that if we start filming every day, people are really going to know how much I wear the same clothes. Someone commented, is it do you only wear gray and black? And now I'm wearing green pants. You're in green today. That's new. Haven't done that in years. That's pretty new. So your comments actually have an impact. That's true. Yeah. So comment below with any tips that you guys might have to help us on our journey to making a full-length documentary. And tune in next Thursday to see if we actually are getting any closer to accomplishing that goal. Tune in Thursday to watch next week's episode of The Collin and Samir Shell or whatever we're calling this. All right. We got five minutes of counting to make this plus. Dude, the story you just told me like that's that's a story.", "publishedAt": "2018-06-22", "transcript_status": true, "title": "A Week in the Life of Colin and Samir", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LnB3a09mN0E2aGt3", "description": "Colin and Samir are filmmakers who are going to make a feature-length documentary. Here's step 1.\nFollow us on Instagram:  http://instagram.com/colinandsamir\n\nSong at the end by Dyalla: http://youtube.com/dyalla\nhttps://open.spotify.com/artist/2n5nqJyjPU7aLL0zbDa34D\n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\n\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "duration": 284, "videoId": "pwkOf7A6hkw"}, {"videoId": "_DRsu5Cv3O0", "transcript_status": true, "text": " Have you ever had an idea and people keep telling you it's good that you have to do it, but you hesitate? And you always think, what if I actually did it? Yesterday, you said tomorrow. Soot. This is a story about someone who had one of those ideas and made it happen. Fast. Yo, what up? Yo, what's up, Red? The last time we were in New York, we met a guy named Red. That's Red. Red? Alright, hit us up, Red. And he told us a story about creativity and about speed. We just bought your book and we have it. Awesome. Thank you. We're going to make a video about it. Okay, Red. Uh-huh, honey. It's a story about a book that was made in 24 hours and became the best cell. But it starts with Kanye. You have to move based on opportunity. An opportunity to make a living at exactly what you dream about, you have to pursue that. Remember when Kanye was tweeting and it was all about creativity? Red was inspired by those tweets. Saturday night, I made a joke on Twitter where I parried milk and honey and paired Kanye's tweets with my really crappy illustration. I woke up and enough people were like, yo, that's hilarious. You should make this a real book. Red didn't know how to make a book. But here's how Red approaches things that he doesn't know. Talk to other people. Like, they're not going to solve it yourself. I just make a list of things like, I don't know. And I make a list of like, who can I ask that might know the answer to this? Yes for help. So I did my Googles and I find out that there is this website called CreateSpace.com. And on this website, you can publish books and films. It's pretty awesome. Website looks like it's from like 1997, but that's totally fine because it does the job perfectly. So now he knew how to make the book. But this had to happen fast. Kanye could stop tweeting. He could delete them all together. Or most likely something new would come up and Red would move on from the idea. I gave myself a goal because I wanted to go to my friend's birthday party of doing this within like two and a half hours. Constraints foster creativity. I spent the Sunday afternoon making it submitted it on Sunday night. I like 9 p.m. and then Monday morning before I got on my flight to San Francisco. I got an email from Amazon saying it was good to go. So now Red had a book, but he needed distribution. I need to tell more people about this. I reached out to all my friends and asked people, do you know anyone that works at Heifiest or Heisnob? Because I knew those were the publications that were most likely right about this. They took the images that I had of the cover and the front page and made it look like it was a real book on a spread. And then they wrote an article about it. Before Red even had a copy, he had a best seller and he was making money. People were buying the book, people were spreading the word. I didn't send it as a gift to John Mayer's Graph diviner. I don't know if that's healthy sell more copies, but it definitely felt cool. In that span, it eventually hit number one new release, which I can't believe a joke had gone that far. Yeah, I'm selling like anywhere between 30 to 40 copies a week. Wow, shit, that's dope. Yeah. So the next time you have that great idea and everyone's telling you to make it, just remember, great ideas can spread quickly. But today, the window of opportunity can be small. So don't hesitate. Get them out in the world. You're surrounded by the people and the tools that can help. So what advice would you have for a creative who has an idea, but it's lingering in their mind? I think a lot of times as a creative person, you hesitate on your idea and you're like, it needs to be done this way or you got to do something this way. And for this, I was just like, no, I need to ignore all those stuff and just get this out into the world. I got a good response from him. And that was just a reminder of myself. I need to stop self-editing before something is done. So are you guys going to make something now? Are you guys going to make a book, a film, a TV show that's published on there? Like what's happening? We're going to make something out there. I'm going to make something out there. I will tell you you have inspired us. That's all I really want to do. Anyone that I share this with, I just hope that they take away that they're going to make something cool. I got to run. Great chatting with you guys. Thanks, Red. See you then. What a cool guy.", "thumbnail": "https://i.ytimg.com/vi/_DRsu5Cv3O0/maxresdefault.jpg", "title": "The Making of a Viral Book", "description": "Colin and Samir talk to video creator Red Gaskell about how he made a viral book and distributed it himself on Amazon. \n\nGET THE BOOK: https://amzn.to/2JGtJ0s\n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nFollow us on Instagram:  http://instagram.com/colinrosenblum\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13Ll9EUnN1NUN2M08w", "duration": 256, "publishedAt": "2018-06-15", "videoUrl": "https://www.youtube.com/watch?v=_DRsu5Cv3O0"}, {"description": "Use our link http://www.audible.com/colinandsamir  or text colinandsamir to 500-500 to get a free book and 30 day free trial\n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nFollow us on Instagram:  http://instagram.com/colinrosenblum\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "publishedAt": "2018-05-29", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LnZxcC04N0thcVRB", "transcript_status": true, "duration": 284, "text": " A question that we get a lot on this channel is how do we make money? Well, this video right here is sponsored by Audible. Audible is a company owned by Amazon. You can get audio books, audio stories from them, and they integrate often with YouTubers. So that's one way that we make money. But before you can even think about making money on YouTube, you need to start by growing an audience. So we're going to give you three tips from a book that we really like that we think can help you grow that passionate and engaged audience that will propel your YouTube career. How did you like that propel your YouTube career? Sounded like we were at a conference. You had like a microphone on and you were like, welcome to making money on YouTube. It's kind of what this is. Kind of, yeah. The book is called Growth Hacker Marketing by Ryan Holiday and you can actually download the audiobook from Audible. The link is in the description. But let's give you these three tips first. I got a hole in my shirt. Wow, that's a big hole. That's a bummer. Yeah. This is a new shirt. I was waiting for you to bring up a shirt. It's a nice shirt. Thank you. So with any idea that you're trying to launch, there's something called Product Market Fit. This is basically just a fancy way of saying, make sure you're creating something that people actually want. The idea here is that you don't need to change the marketing for your product or for your channel. You might just need to change the product itself. So you always want to make sure that you're able to tweak and reiterate what you're making on YouTube to find the best version that you could possibly find. The best way to do that on YouTube is just to start uploading and then make small changes based on audience feedback. Every video that comes along, we look at the feedback and try and make small tweaks to make the show better. We are constantly working on our product market fit. Number two, not all the people, just the right people. A lot of times on YouTube as a small creator, you can get discouraged that you're not talking to that many people. You follow some of your favorite YouTubers and their audiences are huge and it feels like you will just never get there. But the most important audience is the one that you have. Even if you're talking to 20 people or 40 people or 100 people, those people are the most passionate about what you're doing and can share it to their friend. 100 can quickly turn into 200, 400, 800, 1600, 2400. No, 3300. Yeah, I knew I was going to go down. So it's not about the audience you don't have and trying to get a bigger audience. It's about focusing on the audience you do have, giving them the best possible experience and having them help you spread your message. And the third tip, go the extra mile. So pass your audiences expectations of what they thought they were going to get when they clicked. So basically the opposite of clickbaiting. So if you say your video is about something, make sure it's actually about that and then go the extra mile to make it even better than they possibly thought it was going to be. In the book, Ryan Holiday talks about the principle of having a price disparity to expectation. So meaning if it costs $5, make the experience worth $10, right? Or $20. What's an example of that? The fact that you clicked on this video to get information, but you're also getting a free book. So the book that we're talking about, Growth Hacker Marketing, Ryan Holiday actually released to his email list as an ebook for $3. The concept here is that you want people to talk about the videos you make or the product you put out in the world. And because Ryan Holiday's book was priced so low and the experience was so great, people had to talk about it with their friends. Growth Hacker Marketing has been super influential to both of us and has helped us bring a lot of our ideas to life. We can't recommend it highly enough. The link is in the description for the audiobook audible.com slash Colin and Samir. We all want to do more with less. For marketers and entrepreneurs, that paradox is practically our job description. You can also text Colin and Samir to 500, 500, and you will get a link to sign up for audible. If you want to grow your YouTube audience this summer or really just bring any idea to life, put in your headphones and listen to this book. Yesterday, I was listening to an audiobook while I was cleaning, which has actually made cleaning much more enjoyable for me. And if you have any book recommendations for us, make sure to comment them below. Alright, that's it. Good luck. What? Yeah, good luck. You can say that. Yeah. It's not easy to make money on YouTube. It takes a long time. Yeah. But I think these are some tips that will help you. So good luck. Good luck.", "title": "How to Grow an Audience", "videoUrl": "https://www.youtube.com/watch?v=vqp-87KaqTA", "videoId": "vqp-87KaqTA", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "thumbnail": "https://i.ytimg.com/vi/vqp-87KaqTA/maxresdefault.jpg"}, {"text": " This is one of the coolest places I've ever been. We've got about 10 minutes till we board. I think I'm good. I have no idea where everyone is. I'm just going to the sky club now, man. Leave me down here. I texted you. I said I'm at the sky club, man. I'm not going to welcome you to the top. Like, sitting where the local times is 90, 90, 90. Hi guys. Thank you. You done! There it is. That's what we're operating today. It's so big. It's very big. Ah. Hello. Hello. Rachel, you want Shoddy? That's okay. You got it. No, you got it. I feel like it's all right. You should have it. You should have it. You should have it. You should have it. I'm going to hold it. If I can have everyone's attention, Samir wanted me to give a speech. And I have nothing written, but thank you all for being here. Woo! Salt Flats 2018! We're at a camera store picking up some last minute gear. That's all salt. It's not snow. All right. We're here. Whoa. This is crazy. Yeah. Look at that. That's Jack Collin would say. We are out here right now. Yeah. Yeah. I think he would scream that. We are out here right now. All right. Time to start setting up the shoot. I'm feeling ready to go. When they're shooting, our goal is to shoot as much cool behind the scenes content of them shooting photos. That thing is heavy and really challenging to operate. Samir is right there right now filming an interview with Rachel and Daniel. So tell me what the shoot is today that we're doing. Today we are in the Salt Flats in Utah and we're doing a f***ing. You guys thought this was a shoot for Mango Street? This is a condensate. Totally incorrect. The models can go home. Yeah. Don't worry about it. We're here. We're good. Yeah. Appreciate it. Appreciate your efforts. Yeah. I'm going to work on my poses. I'm not sure yet if this is a good idea. I guess we'll find out. This has to be one of the coolest places in the world to skateboard. It's unbelievable. How do these salt fields even come to exist? Anyone knows. Come and blow. I just can't believe you can actually skate on salt. Never mind. Almost fell. It's 6.15. I think the sun's going to go down in like two hours. That's a wrap. That's a wrap. Not fully ready to leave this place. I don't believe you can get out of here. Oh. Come back tomorrow. That was a bad end of the day, Joe. Yeah. That was. It's not the end of this video. But it's the end of the shoot. It's 7.30. We're going to have to go back to the salt field. That's a wrap. That's a wrap. Not fully ready to leave this place. I don't believe you can get out of here. Oh. That's a wrap. It's a wrap. It's a wrap. Here it is. It's 7.30. We left LA exactly 12 hours ago. All that matters is that the jokes are getting bad. What a day. I just want time to start getting ready to go back to LA. I'm really tired. It's a real YouTuber standoff here. Whoa, and Collins filming too. Oh man, that's getting to be back. What's going on?", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "publishedAt": "2018-04-26", "thumbnail": "https://i.ytimg.com/vi/zEXlzhjLkgY/maxresdefault.jpg", "transcript_status": true, "title": "24 Hours in Utah", "description": "▶ Check out our gear on Kit: https://kit.com/colinandsamir\n\nThanks to Mango Street for taking us on this adventure: https://www.youtube.com/channel/UC5bp5_6h-ZxkBz6S_33ZUVg\n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nOur 4k Vlog Camera: http://amzn.to/2pznWgG\nOur Wide Angle lens: http://amzn.to/2IDhRbv\nOur Documentary Camera: http://amzn.to/2Gba1rs\nOur Favorite Lens: http://amzn.to/2pv8MK7\nOur other favorite lens: http://amzn.to/2u8JuWP\nBig zoom lens: http://amzn.to/2Gex7gL\nAdapter you’ll need to use those lenses: http://amzn.to/2GfBacK\n\nHard Drives we use: http://amzn.to/2IJbJhQ\nRandom thing we never knew we needed: http://amzn.to/2pxk4NG \n\nThis piece was edited and co-produced with Kerry Furrh. You can check out more of her work at her website: http://www.kerryfurrh.net/\n\nSEND US A STORY to colinandsamir@gmail.com", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LnpFWGx6aGpMa2dZ", "videoUrl": "https://www.youtube.com/watch?v=zEXlzhjLkgY", "duration": 242, "videoId": "zEXlzhjLkgY"}, {"duration": 296, "publishedAt": "2018-04-13", "thumbnail": "https://i.ytimg.com/vi/mY-ocubOA4Q/maxresdefault.jpg", "text": " We're shooting with Mango Street today and the great thing about shooting with Mango Street is that was give us great fruit Laquat. Everybody else says it look right. So if you ever see them just ask for a Laquat. They always have it on them. I'm going to show you a little bit of the fruit. Do I give them the treat and tell them to go camping? I just tell them to go camping and then I'll get the treat. Hey Carl! Carl! Go camping! Carlton, go camping! Carl! Go camping! Alright, now I'm going to give you the treat. Good job! Wow! Okay, should we start this video? Yeah. Alright, let's start. Today we're shooting a tutorial video with our friends Mango Street, also known as Rachel and Daniel. I guess I should have said Rachel and Daniel also known as Mango Street. Yeah. Okay, you guys get it. But we're shooting this tutorial. I don't really know how to explain it, but it's like the coolest effect I've ever seen and they did it in one of their videos. Here that is. LA has a lot of really good walls and they reached out to us and asked if we would stand in for their tutorial. Obviously we said yes. And if you've been watching this channel for a while, you know that we are seasoned models. Oh no, yeah. We're not. So we're going to bring you behind the scenes today while they shoot their tutorial. Trilette. Come on, I think you're going first. Yeah, I got this. I'm not even like worried about it. We're taking these awkward yearbook photos. It's to recreate the beginning sequence of a TV show. If you can name that TV show, comment that below. Awkward. More pain. In three, two, one. Action. I think that was good. You think it was good? I'm pretty confident it was good. You're pretty confident it was good. Why don't you just say it was good? It was terrible. Good job, man. You ready? Yeah. Whoa. Hi. These guys have a YouTube channel too. I'm going to make some air. Are you okay? What are your names? He's Colin, I'm some air. Yeah. Cool. I'll show you guys out. Yeah. Yeah. Yeah. Cool. I'll show you guys out. Yeah. This is the first wall that we're shooting at. Basically, I don't know how to explain this. Basically, they're going to shoot photos in like a semi-circle around it. And then it's going to like feel like a continuous... We also ended up hanging out at the place for kind of a long time. So it's almost seven o'clock and we're losing daylight pretty fast. You're doing great. So we just finished my photos, but now we've got to do some mirrors. It's getting a little bit dark. We are really losing light right now. Did you get it, guys? Did you get it? You got to wrap it. I have no idea how it looked at that. It's not easy to hold that pose. No, it's not. Are you giving this camera when you're ready? It's grass for its YouTube marketing. If you have a YouTube channel and you have chalk, you can definitely pick up subscribers. Alright, let's go. We're losing light. Come on. So we just wrapped our shoot doing our orbiting hyperlapse transition. And I saw some of the shots. They looked amazing. If you guys want to learn how to actually do that and recreate it, it's really awesome. So check out Mango Street's channel for the tutorial on how to do it. And I think we'll try one ourselves and post it to our Twitter. So stay tuned. Yeah, but we're not as good at photography. We'll probably use the Instagram stop motion feature. Yeah, yeah. They're like really good. Guys, last words? Yeah, that was fun. Yeah. Thanks for being our gate pigs. We're always being our gate pigs. Yeah. We're going to leave you with some shots of Carlton. And so subscribe to us and subscribe to Mango Street. You", "videoUrl": "https://www.youtube.com/watch?v=mY-ocubOA4Q", "videoId": "mY-ocubOA4Q", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13Lm1ZLW9jdWJPQTRR", "description": "Rachel and Daniel from Mango Street are one of our favorite channels on YouTube. Check out their full video here: https://www.youtube.com/watch?v=t5T57NMn1PQ\n\n▶ Check out my gear on Kit: https://kit.com/colinandsamir\n\nMUSIC BY SEAN: https://soundcloud.com/seanmcs\n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Twitter: http://Twitter.com/ColinandSamir\n\nFollow us on Instagram:  http://instagram.com/colinrosenblum\n\nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "title": "Behind the Scenes with Mango Street", "transcript_status": true}, {"text": " Moment of truth, the $16 cup of coffee. This is Bluebottle Coffee. This is a line that forms every morning. Some people come here just to take photos. We know most of the breeze does, because we come here a lot. We get the $5 mocha, and sometimes the $4.50 waffle. Never had the $3 saffron, snicker-doodle, the $4 blackberry-pollented tea cake, the $1 chocolate, but we have had the $9 off of Cato Toast, and we get it way more often than we'd like to admit. That's kinda worth it. When we heard they started serving a $16 cup of coffee, we thought we'd give it a try and see. Is it worth it? We're gonna do it. It's a $16 cup of coffee. Yemen, our donuts. We're doing it. This is the story of the most expensive cup of coffee we've ever had. Okay, so it may seem like just another cup of coffee, but there's a story to this coffee. It comes from Yemen, a country so racked by war, its coffee has been largely out of reach for decades. This is Mochtar. He grew up in San Francisco, but his family's from Yemen. Okay, we're here today. It's one of the most famous coffee going regions in Yemen. Do you look over here? These are the terraces that I have coffee. As you can see, they're high, high up at the mountain. He never really liked coffee, but when Mochtar tried the Yemeni coffee, it was the best cup of coffee he'd ever had. He went to Yemen and spent time trying to figure out how to bring Yemeni coffee to the US. And it was harder than he thought it was gonna be. If I knew that I was gonna go through a war-torn country, escape bullets and airstrikes, and leave on a boat across a giant ocean, I would have never started this journey. Mochtar found a fisherman to take him on a seven-hour journey from the port of Mocha to Africa. In search for the best coffee, sometimes he has to sacrifice something. So, three yards. Hopefully, see you guys on the top. Blue bottle started selling it at a stunning price. $16 a cup. That price begins with farmers in Yemen being paid at fair price and exported from a country in conflict. One village had a huge meeting and they, you know, they realized how committed that was for them. And if it wasn't for their hard work and their belief in my vision, I wouldn't be able to do this work. Okay, back to the coffee. Here's the moment of truth. We're officially trying the $16 cup of coffee. In the river, and all the snow is in the tree. It's good. It's definitely a good cup of coffee. It's a great cup of coffee. So, in this moment, we realized that, even though we drink a lot of coffee, we're not coffee experts. Am I just telling myself it's good? Because it cost us $16? I'm not sure. I feel like that may be the case. But when you sit at a coffee shop and film yourself drinking coffee, you tend to draw a lot of attention. Luckily for us, there were some coffee experts at our table. You wanna try it? Here we go. Okay. The only time ever we're gonna have a $16 cup of coffee. Would you like to drive some as well? $16 cup of coffee. $16, good? But it's good. It's good. It's good. It's good. Yeah, go for it. Trying to get stuff out of here. Sheathing around. I mean, quite enough. Safe sometimes. I mean, it's... Yeah. So, it's more than... So, it's more than... I mean, it pivots a one-off. I'd probably pay $16 just for a while. Yeah. That's what we're doing. Good conversational piece. We got to meet you guys. Yeah. Yeah. So, they tried the coffee and then they ordered a bunch of coffee and gave us a lesson in coffee tasting. There's just giant steps. Oh, yeah. The best. These guys were awesome. And they invited us to their coffee shop in Dallas. Over the next 30 minutes, the coffee attracted almost everyone in the coffee shop. It's from Yemen. It's really hard to get it over here and import it. So, yeah. He's calling on Samar. Yeah. So, check it out. Yeah, well. All right. Nice to meet you guys. It was something to talk about and a story to share. So, like we said, there's a story to this coffee. What a great experience. We met so many people just from getting two cups of coffee. Very worth it. It's just going viral. It's not going to be a baby. It could. Yeah, the exciting if it did.", "thumbnail": "https://i.ytimg.com/vi/rnd0dtbduZU/maxresdefault.jpg", "publishedAt": "2018-03-13", "videoId": "rnd0dtbduZU", "duration": 281, "videoUrl": "https://www.youtube.com/watch?v=rnd0dtbduZU", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LnJuZDBkdGJkdVpV", "description": "Colin and Samir try Blue Bottle's $16 dollar coffee. They see if it's actually worth the money and tell you why this Yemeni coffee is so expensive. \n\nCameras we used for this video: http://www.kit.com/ColinandSamir\n\nThe Coffee Guys from Dallas: http://www.eilandcoffee.com/\n\nFollow us on Twitter: http://www.Twitter.com/ColinandSamir\n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Instagram: \nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "title": "$16 Coffee: Is it Worth it???", "transcript_status": true}, {"videoUrl": "https://www.youtube.com/watch?v=oemgPLZKVFI", "publishedAt": "2018-02-16", "text": " So we're back in LA and we have a lot to say about this crazy ridiculous road trip that Jack took us on. But first let's catch you up on our final day of this trip. This is the last episode of the Jackcoin Crime. We started at the Malibu RV Park and now we only had 24 hours to get this happen Cisco. So we had to step up. But if you ever get the chance to take a road trip in California, you have to drive up the Pacific Coast Highway. We highly highly recommend it. I got fired as a million views. Woo! That's insane! We are out here right now! At this point our spirits were very high. RV life is too good. Not ready for this to end. I didn't think I was going to like YouTube doing YouTube as much as I do but it's really fun. It was getting dark so again we had to pick some things. Hi, nice to meet you guys. Hi. Nice to meet you. Nice to meet you. Hi there. God you guys made it. That's Jane and that's Kate. They work at One Wheel and invited us to the office for a late night ride. Lift your gear up. Off on the back and you'll sit down. Back to the back. Let's see you guys later. Woo! Why is the mirror just like moving around like that on the bus? It's so fun. You got it there on this slow motion. Yeah. It feels like a video game. We made it almost all the way to San Francisco but decided to stay the night in Santa Cruz. It's like we can see a friend for a while. The next morning we woke up at our campsite and had to drive about two more hours to drop off the RV outside of San Francisco. And it seemed like the trip was truly coming to an end. I just can't believe that my job is just going adventures. Luckily we got picked up by an even bigger RV right after dropping off the first RV. A group of guys from a nonprofit called the Traveling Good were on their way down anyway and picked us up. We got connected to them by the guys at Yes Theory, which if you could remember we were hanging out with at the beginning of the series. The closer we got to LA the more Jack wanted to continue this adventure. He did not want it to end. So serious. The camera is off and I'm going to Canada right now and I'll be so stoked. If you guys are now I will go anywhere right now. I got to be in Utah by Thursday. Dude let's go to Utah! Salt Lake! Salt Lake! Let's go! Let's go and never be in Utah. I'm taking a free snowboarding and a snowboarding. Snowboarding! What? Guys! Somebody tell me give me a good reason why we shouldn't go. Whatever it takes let's get there. Let's do it! We got beds! We got this sick RV! It would be so dumb to not go. I'm not even filming right now. Still it would be so dumb to not go. Let's go! Let's go! It was a compelling argument but it didn't work. And we finished out the trip editing the rest of our videos on the way down to Los Angeles. And that truly was the end of an incredible four days in an RV. It definitely seems like Jack is on the path towards finding whatever it is that he's looking for. Give us one piece of advice for someone that wants to make videos. Just do it! Oh, alright. That was easy. That was easy. Simple. Yeah. Okay. Cool. I have to work here. Like I can't not work here. This is the most amazing office of all time. So serious though.", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "duration": 266, "description": "Jack Coyne is a YouTube Creator that spent 7 years working as an assistant to Casey Neistat. In this video he gives one tip for aspiring creators. \n\nWatch Jack's Video: https://www.youtube.com/watch?v=cLIj-S-I7xY\n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Instagram: \nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "transcript_status": true, "thumbnail": "https://i.ytimg.com/vi/oemgPLZKVFI/maxresdefault.jpg", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13Lm9lbWdQTFpLVkZJ", "videoId": "oemgPLZKVFI", "title": "Jack Coyne's ONE tip for YouTubers...wait til the end"}, {"title": "Mic Comparison: Shure SM7B vs Rode NT1A", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13Lng5STVsQWl0MTFr", "transcript_status": true, "duration": 293, "videoId": "x9I5lAit11k", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "description": "In this video we compare two microphones in search of the ultimate podcast mic. The Rode NT1-A and the Shure SMB7. \nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Instagram: \nColin - http://instagram.com/colinrosenblum\nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "thumbnail": "https://i.ytimg.com/vi/x9I5lAit11k/maxresdefault.jpg", "videoUrl": "https://www.youtube.com/watch?v=x9I5lAit11k", "publishedAt": "2017-12-13", "text": " We're starting by saying this is a video about audio, but we may do that with text. Yeah, I kind of think it'd be funny if we're talking, you can see our mouths moving, like beat drops. When people are watching a movie, they're more likely to forgive moments of bad video than they are bad audio. So right now we've got really, really weird video, like just awful looking, but the audio still sounds good, and we'd be able to tell you a full story with good audio and bad video. But with bad audio and good video, it's a lot harder to keep watching. Whatever we're doing right now, you're probably less inclined to keep paying attention, and you just can't wait till we turn my back on. So basically we use audio on top of the mic, like if we're filming a documentary and we need to capture sound that's happening in the space. Can't get over the audio point. So good. Or if we need to film the gaps in the story, we'll use voiceover. So in both scenarios, we need really good audio. When we started making videos, we would do our voiceover on iPhones. Sounds bad. Not good. In this video, we are going to be comparing two mics that we just got, the Sure SM7B. The road NT1A, these are the two mics that we will be comparing, and we need your help citing which one we keep and which one we return. So at the end of the video, we're going to put a poll up in the corner, and we're going to have you vote on which mic you think we should keep. This is the Sure SM7B microphone, and it comes in around $400. The box is super simple. It kind of looks like if Apple were to make a microphone. In the box, you'll find the microphone, this windscreen, and then a couple of other accessories. This thing looks like a bracelet. Not totally sure what it does though. Do you know what it does? No idea what that does. Supposedly, this mic has a little bit more bass in it, and you'll see it a lot in podcasts. If you watch Gary V, this is the mic that he uses. Different mic. Check, check. Whoa, that mic's way louder. Way louder. Way louder. And this is the road NT1A microphone. The first thing you'll notice here is the packaging. Sure looks like the dark side and star wars, and this just looks really friendly, something that you would want to do. Looks like if you're going to become a pop star. Yeah, this looks like you're about to be in one direction or something, like a pop star. So this whole package comes in at $2.29, and there's a lot more in the box. The microphone, a little bag for the mic, a shock mount, and a pop filter, and an XLR cable. So it's basically everything that you would need to get set up with this mic. This microphone also is a condenser mic, so it's more for vocals and probably will sound a little bit more trebly. Well, people know what that means. The high frequencies will come through more. You'll hear more of the full words. Basically, after doing a bunch of research on these mics and asking a bunch of our friends, the feedback we got is that both these mics are really good, and it really comes down to how our voices sound on these mics. And we need to find mics that work for both of us. So how does my voice sound in this mic, or this mic, and then how does my voice sound in this mic? As opposed to this mic. So there's the road NT1A condenser mic, and the Sure SM7B, not condenser mic. Is the most scientific way I can explain it. Yep. So make sure to like this video, subscribe to the channel, vote in the poll which mic should we keep, and comment below if you think we should do a podcast. Also, if you have any questions just about audio in general, we are by no means experts, but if you have questions, we'll do our best to answer them. Also, if you have answers, yeah, actually, if you have answers to how to get good audio, let us know. Check, mic, check, check, check, check, check Oslovakia, check, check, Republic, check, check, check, mate. Whoa, that was cool. Start check. Start check."}, {"duration": 248, "thumbnail": "https://i.ytimg.com/vi/d1Qh9-ok4UI/maxresdefault.jpg", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LmQxUWg5LW9rNFVJ", "transcript_status": true, "description": "SIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Instagram: \nColin - http://instagram.com/thecollieollie \nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "videoId": "d1Qh9-ok4UI", "text": " Saturday morning, I am in my apartment in Santa Monica. We got this new camera. I know it seems like we're always getting new cameras, but we're trying to figure out a vlogging situation. We have that big camera, the Sony FS5, and we've actually been vlogging with it, which has been kind of ridiculous. Yeah, this is ridiculous. Yeah. Because it's huge, and if we drop it, I would be devastated. The other camera that we got was the Sony RX. It's a little like pocket cam, and we thought that would be good, but it's not really wide enough. It's a mirror, and I are kind of like crowding each other, and the audio is terrible. So we got this one from Sammy's camera in West Hollywood. We're hoping that this is the solution. It's a Canon Rebel T7i. It looks like that. And one cool thing that I really like about it is that it's got autofocus, and it's got touch autofocus. So I'm at a focus, but if I click on my face, my face gets in focus. Kind of cool. So basically, I'm just taking this camera this weekend and testing it out. I've been shooting different things with it. This morning, I just did my morning routine. Wake up. Check Instagram. Make my bed. Make my tea. Take a shower. Make breakfast and get a coffee. Other than that, today, I want to finish now boarding episode three, where we go to Las Vegas. We have a bunch of really cool drone stuff in there, which I'm excited for you to see. I flew the drone for the first time in this episode, so that'll be cool. I feel like I did a pretty good job. Should come out probably the day after whenever this comes out. I just finished up doing the narration for it. In early August, we were in New York. Again, should come out the day after this comes out. In one of our last videos, we talked about an intro that we were going to use for vlogs on this channel. At the time, I liked that one, but I really enjoy making these intros, making logos, adding music to them, and I was working on one a couple days ago and came up with this. I think that one's much better. It also drives home the point of Colin and Samir, as opposed to just the date, which I thought was really important. Because if you're going to see this intro to the vlog, you should know, if you're a first time watcher, it's Colin and Samir. Having the date in the intro meant that you'd have to recreate this intro every time, which probably would have been a pain. If you're trying to vlog consistently, like we are, then you don't want to have things when you down or taking extra time, like having to make a new intro graphic every time. So here it is again. Let me know what you guys think, but I think that's definitely the one we're going to go with. Lastly, I'm probably going to go to the beach, and then that'll be it for this video. Peace. That's a weird sign off. I don't know. I don't have a solo sign off. Normally, Samir is later and hits the frame. I don't know. I'll keep working on it.", "title": "Our vlog camera", "videoUrl": "https://www.youtube.com/watch?v=d1Qh9-ok4UI", "publishedAt": "2017-08-27"}, {"title": "CLEANING UP OUR STUDIO", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LjM4Z3pjWUhveHFN", "duration": 266, "transcript_status": true, "videoId": "38gzcYHoxqM", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "publishedAt": "2017-05-22", "description": "Sunday in the studio, cleaning and prepping for a photoshoot we have o Monday. \n\nCheck out Brads Channel: \n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Instagram: \nColin - http://instagram.com/thecollieollie \nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "videoUrl": "https://www.youtube.com/watch?v=38gzcYHoxqM", "thumbnail": "https://i.ytimg.com/vi/38gzcYHoxqM/default.jpg", "text": " Sunday in the studio we have a shoot tomorrow so we're gonna spend the afternoon Cleaning and setting up the studio Brad's here and he's already working You want to do a big overhead of all this? You think we can? Brass it, yeah Alright studio is clean stage one is done now stage two we're making sandbags So we use sandbags to We use sandbags to weigh down things that need to be weighed down so they don't fall on you like a light Like a light on a big thing put a sandbag you guys get it. We're gonna take that bag of sand and put it in that bag That's basically it. It's pretty simple Two sandbags down It's like a dead the beach Sandbags These are pretty heavy Moving into stage three of our studio prep which is setting up our different setups Does that make sense? Tomorrow we're gonna have a shoot with three different setups one is Back in the main studio room and then we're gonna have two different setups here Our plan is to shoot on a couple of different colors of paper So all these different colors we're gonna have set up it should be pretty cool That's calling It looks over all of our stuff all right, so we put this set together and we're gonna take some test shots right now See what this looks like Yeah, so that's stage four of our setup This is what the photos look like that Brad's taking me right now Pretty cool, huh? Oh Good, yes, all right, so that setup seems to be working pretty good We're gonna test this one and just about the last phase for the day or stage I think I've been doing this in stages. Here's a thing about testing this though. It's like really pristine white So I got to wear my socks and I got to put covers on them Here we go These little socks you got to wear You're coming on this thing All right, here we go All right studio prep is done Should be about it for the night I think Colin and I still have to do a couple things but Studio's ready for mall. Yeah, cool. It's probably where I'll end the vlog and we'll see you guys tomorrow Stage five studio's prepped Good pretzels are done You finished that whole bag of pretzels I'm like currently in the process of finishing them. Yeah, also I hate your pretzels and well You ate your pretzels and his pretzels you know you can't leave pretzels out here like that You"}, {"publishedAt": "2017-05-16", "title": "Friends at the Studio", "transcript_status": true, "videoUrl": "https://www.youtube.com/watch?v=Kkp0Fedru-w", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "duration": 264, "text": " How'd it go back there? You're one good. Feeling like straight poo. Oh. Loki looking like Winnie the Pooh too. Okay. I'm sure you know. So that was Brandon. Uh. Brandon is the guy who was in the studio during our big in Japan video. He was just doing some photography in the back and yeah. He looked like Winnie the Pooh, but he also kind of looked like these memes that I've seen. They put the hood up and then instead of a face, it's a balloon. And then they dance like, oh, never seen that. He's the meme guy. I love memes. If you have any good meme accounts, comment them below because I love memes. Back in the studio today, over the weekend, we checked out some of the videos you guys sent us. Thanks to everyone who sent us videos. I think we got around like 15 videos, which is awesome. One of the first ones we got was from Talib. Did I say that name right? Talib? Talib? I don't know, actually. Correct us if we're not saying it right. The channel is TFF Entertainment, and he sent us this 15-second video of this bird. And it was just really calming. I think my favorite part was the colors. Just like the building and the sky it all just worked really well together. Next video is from Joss in Denmark, who sent us this really cool video of him biking to a point, taking a picture, and then painting that picture, which was a lot to fit into 15 seconds. Did you see the snack mission? No, I haven't seen the snack mission. Ben sent us a one-minute long video of him going to get a snack. Oh man, it's pretty good. I can't wait to see that. And then the last video I wanted to talk about was from Garrett Eddie, who sent us a video that was probably the most like the one that I posted, where he is going across the border from Canada into the US. So that was cool. Thanks for everyone who did that. That was really awesome to see. I didn't know if we gave an assignment if people would want to do it, but that was awesome. Yeah, if you have any other videos that you guys create and you want us to check out, you can email them to callin'andsameeratgmail.com. I was the coffee. Thank you. It was good. You want to say hello? Is it on right now? It's on your in it. Hi, how are you? Are you? Am I in New York? Monday. Are you in for her? Oh, I'm back. The best part of having a studio is getting to have other people come in, get creative in it, and just seeing everything that can come out of it, and also just like having a bunch of people hang out. Yeah. Brandon did this really cool creative shoot last week that we were all actually in. We wore these crazy outfits, so it's insane. Any other questions or topics you guys have? Comment them below. We're almost at a week of daily videos. Yeah. So that's pretty cool. This is going to be an interesting week, too. We still have a lot of editing and different projects we're working on, but at the end of this week, we're actually going to go and start a new project and you guys are going to come with us to that. So that'll be a really cool experience. So today, we have to go over to West Hollywood to a camera shop. We got to do a couple things to our cameras. So we're going to bring this camera with us. We're going to film a bunch of stuff around L.A. and put together an edit. Whatever that looks like, it's going to look like this. Alright, so we're back at Sam's testing cameras. And right now, we have a Canon G7X. It seems like it has a stabilizer on it, so it's not as shaky as the last camera that we tried. And that's a 70D. This one's really nice. Yeah, this is pretty nice. Now we are on the 80D. Not the right lens for this. Not the right lens. One of these days, we're going to buy one of these cameras. Thanks for watching.", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LktrcDBGZWRydS13", "thumbnail": "https://i.ytimg.com/vi/Kkp0Fedru-w/maxresdefault.jpg", "videoId": "Kkp0Fedru-w", "description": "This was Monday May 15th! Thanks to everyone who sent us their videos. \n\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Instagram: \nColin - http://instagram.com/thecollieollie \nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com"}, {"videoUrl": "https://www.youtube.com/watch?v=5MnoAsJ1Idg", "duration": 270, "title": "Should you go to film school?", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LjVNbm9Bc0oxSWRn", "transcript_status": true, "description": "COMMENT YOUR QUESTIONS BELOW\nSIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nFollow us on Instagram: \nColin - http://instagram.com/thecollieollie \nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "thumbnail": "https://i.ytimg.com/vi/5MnoAsJ1Idg/maxresdefault.jpg", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "videoId": "5MnoAsJ1Idg", "publishedAt": "2017-05-11", "text": " You can touch my neck is your breath, I'm so fine. Alright, it's my skin. So yesterday we made a video and we asked you guys to give us some topics to talk about. And right now we have 67 comments and a bunch of topics. So thanks to everyone who commented, we're going to answer one of these and if we didn't answer your question, we'll probably go through and type an answer in comments. Umm... Our question today is from Alex Duzzi and he said that he's taking some film classes in high school but wants to know if it's worth majoring in. He also said, I wanted to know if you can really make it as a filmmaker or photographer. So the reason why we wanted to answer this question is because Colin and I have two different paths here. I was a film major in college and Colin wasn't. I studied economics and Italian. And we both ended up here making videos. I started out college as an econ major. It was kind of the only thing I knew and what I thought would apply to everything. But when I was in college, I knew I wanted to be a filmmaker. I wanted to make films since I was a little kid. One day I just decided I'm going to change my major and I'm going to go into film. My parents definitely were a little bit uncomfortable with it, but I just decided that no matter what, studying film was going to help me in life. Having a film major, there's two aspects to it. One, you get to study film and learn about the history of it and the impact it's had on society. And two, you get to produce. It was an amazing opportunity to have equipment and people who are interested in film and the resources to just make stuff. They had an editing facility and it was just like, I could stand there all night, I could edit, I could make stuff, and I had people to give me feedback. So I would say if you're really interested in film, you don't necessarily have to end up becoming a filmmaker. But what you learned by studying film can apply to anything. That's how I feel about it. So I definitely think it's worth majoring in. If you're a little concerned about it, you can major in film and minor in something else. You just have to work extra hard. To that second question of can you actually make it as a photographer or a videographer? My recommendation would be to find some aspect of taking photos or making videos that you would like to do regardless of whether it's your full-time job or regardless of whether it pays you. When I got out of college, I was working at a hotel 40 hours a week and then filming and learning how to use my camera after work. I wasn't following chapters of a textbook. I was literally just making things and adjusting as I went along. And I loved it so much that I didn't really care if I was tired or if I was taking up all my time after work. And then Samir actually offered me my first job to use a camera. And it was like an immediate yes. It was like someone will pay me to do what I like to do and that was a no-brainer. And now from that point on my time has completely shifted and I always get to use a camera. If that's what you want to do, just make the time to do it and try and find something that you enjoy regardless of whether you get paid and then hopefully at some point you get paid. So you guys probably didn't watch all of it but we just talked for like 12 minutes. So yeah. So we try and like do like an incoction. Let's try and wrap that up. First question, should you be a film major? I think there's pros and cons to being a film major or not. Regardless, you want to just try and find something that you enjoy if you're going to be doing it for like two to four years. You want to come out of it being able to problem solve and work with other people. And if you learn those things no matter what, you can then start being a filmmaker or you can be anything else you want to do. And question number two, can you really make it as a filmmaker or a photographer? Yes, tons of people do it but you have to commit yourself to it. You have to be clear about the fact that you want to do it and you have to go at it no matter how hard it is every day. Hopefully that was helpful and that gave you some good advice. If you're anyone out there who's interested in film and going into college as a film major or studying film. If you have any other questions about that specifically, comment them below and anything else you guys want us to talk about tomorrow, leave it in the comments. And we will see you guys tomorrow. See ya. You"}, {"title": "A DAY IN THE LIFE OF COLIN", "videoId": "9tv5clYvqOk", "transcript_status": true, "thumbnail": "https://i.ytimg.com/vi/9tv5clYvqOk/maxresdefault.jpg", "text": " I You Bacha green tea powder I am not a morning person, but I couldn't really sleep last night happen to be up figured I'd take advantage I Again, this is not something I normally do That is great lighting for a vlog I Today we have a photo shoot down at the studio, which is what Samir was coming for yesterday I've got some more editing to do and the best thing about photo shoot is is that we have tons of snacks and the studio is really packed with people Here we go Oh My goodness, I'm bottom on the internet, so this Samir know about these not doing this. Oh my gosh. I'm so happy. I'm the first one to see these Yo, yo Wait, are you a studio? Yeah, I'm already here What the hell? Yeah, I'm coming in right now This is the first time you've woke up before not I make sure people knew this is not what I normally do You see Brad's outfit? Trust me Brad is prepping the studio right now, and I'm gonna stand in so you can get it ready Call him tomorrow, you know, you want to take any photos and then my way? Put it on Instagram. So I have to make it to the cardboard Cool Okay, no we're good. We're good. We either jump or Jump up I'm gonna move the car prepared ready three two one Yeah That's pretty good. That was pretty good. Yeah teamwork It's good to go So while they're shooting I'm gonna work on a couple things We have some videos that we want to put out one which is about playing handball in New York Another about going up in a helicopter, and then I also want to work on our mailer We have a mailing list if you didn't know link is in the description You know how like you're normally the person with food in their teeth? Yeah I hate that that's like I know what I'm laying for that's the truth Okay, my whole morning might be a wash because you because I had an everything bagel Oh my god, and I didn't realize I had stuff in my teeth until like I got here That's that's part of vlogging that's part of vlog just gotta keep it in yeah But it was devastating yeah, that is devastating We are on our way to pick up a lunch right now to the crew Let's do this thing We brought the skateboard. We're just gonna skate and shoot some slow-mo footage real quick I feel like brads really hungry and when you watch this vlog he's gonna be really upset that we like picked up food and then just chill and skate it. Yeah It's a good time to know yeah Wow Has microphones here That would have like changed everything for me when I was doing YouTube right all you know Kate was one of the original I think I didn't know that because I don't think people realize that when you're making YouTube videos It's like a time job the worst thing in the entire world is when you put a video up and The first comment is I like your last video better All right, day is winding down a little bit more of the photoshoot and a little bit more editing Yeah, I think we should close this out now I mean, it's my vlog. I know it's my vlog, but you guys want to come close it out with me Thanks I don't think they'll see us tomorrow, right maybe actually. Oh, we'll see you tomorrow. Oh, no Make sure to subscribe and keep an eye out for some of our newest videos maybe tomorrow Possibly are we daily vlogging? I don't know", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "duration": 294, "description": "SIGN UP FOR OUR NEWSLETTER: http://bit.ly/2ggsxxz\n\nWATCH SAMIR'S DAY: youtube.com/watch?v=hpJ_umfsdpA\n\nCAMERA: http://bit.ly/2cDYX6O\nSONG: Proleter - Destiny\n\nFollow us on Instagram: \nColin - http://instagram.com/thecollieollie \nSamir - http://instagram.com/samirchaudry\n\nSEND US A STORY to colinandsamir@gmail.com", "publishedAt": "2017-04-21", "videoUrl": "https://www.youtube.com/watch?v=9tv5clYvqOk", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13Ljl0djVjbFl2cU9r"}, {"thumbnail": "https://i.ytimg.com/vi/qt2xEQxcYsg/maxresdefault.jpg", "id": "VVVhbUxzdEp5Q2EtdDVnZlplZ3hzRk13LnF0MnhFUXhjWXNn", "publishedAt": "2016-11-26", "description": "Colin goes home to New Jersey for Thanksgiving 2016. FOLLOW US @colinrosenblum @samirchaudry", "duration": 297, "transcript_status": true, "text": " What was life like when you were in college? That's my older brother Tim, interviewing my mom in 1994 for what I think is a school project. Here come the same college. And there I am, determined to mess up this interview at all costs. I'll get back to this, but now let's go to Los Angeles this past Tuesday. I moved to Los Angeles on May 31st, 2012, and at this point, consider myself almost fully a California, but it wasn't always a smooth transition. I drove out to LA with one of my friends from home. We broke down in southern Utah, lost 40 bucks in Vegas, and finally made it in time for my first day at work. Since then, I've moved a lot. I've taken short-term leases and never really considered LA to be home. My first night was in the Hollywood Hills. After that, I spent eight months in midwilshire, found a place on Craigslist in East Hollywood, one year in Culver City, six days in downtown. I went week to week in this spot in Hollywood. There was no kitchen, and my room was as big as my air mattress. At this point, I was definitely ready to go home, and LA never felt more temporary. Two weeks in Echo Park, one good year in Pico Robertson, and what has been eight great months in Santa Monica. On a map that looks like this, but this is where I live, and where I think I'll live now for a while. But this is where I'm from, and where my family is. Let's talk about my family. I have two older brothers. Scotty, say hello. Hi. Tim. Hi. And I'm the youngest. And there's Pauline. I'm almost behind the camera, and that's my dad. Now normally, this is how I interacted my family in LA. Really? You think that the other one? I was exactly your message. Oh, Colin. Hey, Pops, how you doing? Hello? It's up, dude. Hey, how you doing? I'm just getting ready to head to the airport. Are you checking okay, I'm all checked in. Nice. I'm just thinking it. When I'm working with New Jersey, I never thought I would stay here. You know, I am oldies years older, and I'm here, and you're not? I get in late tonight, right? Yeah, I'm in at like 11.30 tonight. That's what I thought about California. I never thought I'd stay here. I mean, I will check you when you get home, and something's going on with the port, don't I? I keep moving on. Bye. But this week, for Thanksgiving, I had the opportunity to go home. Hey, Dad. How are you? We're going to give you a tour of the house now. That's my home. I lived there for 18 years. Right now, we're starting a new addition, and this is where it's going to come out. We've got a lot of work to do. Both my older brothers are married and have their own families. It's been Eric built this little deck where we all sit. My parents are grandparents. You can come down. And my grandparents are great-grandparents. Thanksgiving 1991. I never thought I'd move to California, more importantly than I'd stay in California. Thanksgiving 1991. What a picture. I'm always thankful to go home whenever I get the chance. Give me a wave, Scott. Just look. Nice. Nice. Everything that I've done in California and everything that I continue to do is in large part because of the support that I have at home. What do you want your family to be like in the future? I want my family to be fun and giving. I hope that all of my boys will be sensitive people and to take care of their own families who are responsible and to love their families and stick by their families and their friends. We're all together. I had a really weird set of goals. I wanted to own a red sports car. I wanted to live by the ocean. I wanted to have a really fun job. Mary Sullivan really loved me a lot. I wanted to have kids. And I got to do every single one. So I like the snap from me. And that's our interview and thanks for sharing it time. It was fun. When I moved to California, did you think I would stay? Oh, did I think you would stay? No. No, I don't think I did. I thought you would stay for maybe a year. And now I know you're coming home. But it's a good spot. It's a good spot for you. And it's a great place to live. I mean, you do all the things that you enjoy doing.", "channelId": "UCamLstJyCa-t5gfZegxsFMw", "videoUrl": "https://www.youtube.com/watch?v=qt2xEQxcYsg", "videoId": "qt2xEQxcYsg", "title": "Home Away from Home"}]